package by.itstep.javatraining.revision.task;

/*	Task X. Minsk Ring Road [МКАД]
 *
 *	Длина Минской кольцевой автомобильной дороги примерно равна 56 километров.
 *	Студент-байкер стартует с нулевого километра МКАД и едет со скоростью V километров в час.
 *	На какой отметке он остановится через T часов?
 *
 *	Примечание
 *	1) Не забудьте про "защиту от дурака": время не может быть отрицательным.
 *	2) Скорость может быть отрицательной - это будет обозначать, что студент-байкер
 *  едет в противоположную сторону.
 *  3) Данную задачу можно решить, используя только встроенные операции языка.
 *
 *	Формат входных данных [input]
 *	На вход метод получает целые числа V и T в диапазоне типа int.
 *	Если V > 0, то студент-байкер движется в положительном направлении по МКАД,
 *	если же значение V < 0, то в отрицательном.
 *
 *	Формат выходных данных [output]
 *	Метод должен возвратить целое число в диапазоне от 0 до 56 — номер отметки,
 *	на которой остановится студент-байкер, или -1 - если время задано неправильно.
 *
 *	[ input 1]: 40 2
 *	[output 1]: 24
 *
 *	[ input 2]: -1 1
 *	[output 2]: 55
 *
 *	[ input 3]: 10 -5
 *	[output 3]: -1
 *
 *	[ input 4]: 0 3
 *	[output 4]: 0
 *
 *	[ input 5]: 5 0
 *	[output 5]: 0
 */

public class TaskX {
    public static final int DISTANCE = 56;

    public static int start(int v, int t) {
        if (t < 0) {
            return -1;
        }

        return (v * t) % DISTANCE < 0 ? (v * t) % DISTANCE + DISTANCE
                                      : (v * t) % DISTANCE;
    }
}